# Architecture Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DisciplineTypeId..::..Architecture Property
DisciplineTypeId Class See Also
---
Architecture.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public static ForgeTypeId Architecture { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Architecture As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Architecture {
	ForgeTypeId^ get ();
}
```

# See Also
DisciplineTypeId Class
Autodesk.Revit.DB Namespace